RhinoInside.Revit API Documentation
GeometryEncoder.ToSolid Method (SubD)
 Converts the specified SubD to an equivalent Revit Solid.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Autodesk.Revit.DB.Solid ToSolid(
	this Rhino.Geometry.SubD value
)
@staticmethod
def ToSolid(
	value: Rhino.Geometry.SubD
) -> Autodesk.Revit.DB.Solid
Parameters
value
Type: Rhino.Geometry.SubD
A value to convert.
Return Value
Type: Autodesk.Revit.DB.Solid
A Revit Solid that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.SubD. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryEncoder Class
ToSolid Overload
RhinoInside.Revit.Convert.Geometry Namespace